benchmark/result/opium.log
Running 1m test @ http://localhost:3000/
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   902.08ms    1.33s    4.84s    84.53%
    Req/Sec        nan       nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  318.21ms
 75.000%  662.53ms
 90.000%    3.74s 
 99.000%    4.56s 
 99.900%    4.84s 
 99.990%    4.84s 
 99.999%    4.84s 
100.000%    4.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      48.735     0.000000            1         1.00
      84.863     0.100000           81         1.11
     106.879     0.200000          160         1.25
     240.127     0.300000          239         1.43
     308.223     0.400000          320         1.67
     318.207     0.500000          400         2.00
     341.503     0.550000          438         2.22
     353.791     0.600000          477         2.50
     477.695     0.650000          517         2.86
     645.631     0.700000          557         3.33
     663.039     0.750000          597         4.00
     668.159     0.775000          617         4.44
     687.615     0.800000          637         5.00
     765.951     0.825000          656         5.71
    3696.639     0.850000          698         6.67
    3696.639     0.875000          698         8.00
    3702.783     0.887500          708         8.89
    3737.599     0.900000          728        10.00
    3737.599     0.912500          728        11.43
    3883.007     0.925000          736        13.33
    3895.295     0.937500          752        16.00
    3895.295     0.943750          752        17.78
    3993.599     0.950000          756        20.00
    4065.279     0.956250          763        22.86
    4069.375     0.962500          769        26.67
    4071.423     0.968750          772        32.00
    4085.759     0.971875          773        35.56
    4132.863     0.975000          776        40.00
    4151.295     0.978125          778        45.71
    4251.647     0.981250          781        53.33
    4349.951     0.984375          783        64.00
    4358.143     0.985938          784        71.11
    4423.679     0.987500          786        80.00
    4558.847     0.989062          787        91.43
    4562.943     0.990625          788       106.67
    4616.191     0.992188          789       128.00
    4628.479     0.992969          791       142.22
    4628.479     0.993750          791       160.00
    4628.479     0.994531          791       182.86
    4706.303     0.995313          792       213.33
    4706.303     0.996094          792       256.00
    4767.743     0.996484          793       284.44
    4767.743     0.996875          793       320.00
    4767.743     0.997266          793       365.71
    4841.471     0.997656          795       426.67
    4841.471     1.000000          795          inf
#[Mean    =      902.082, StdDeviation   =     1327.715]
#[Max     =     4837.376, Total count    =          795]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  795 requests in 8.27s, 74.53KB read
  Socket errors: connect 0, read 14548, write 0, timeout 4807
  Non-2xx or 3xx responses: 795
Requests/sec:     96.10
Transfer/sec:      9.01KB