benchmark/result/opium.log
Running 1m test @ http://localhost:3000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 2385.448ms, rate sampling interval: 22036ms
  Thread calibration: mean lat.: 2356.003ms, rate sampling interval: 22003ms
  Thread calibration: mean lat.: 2401.894ms, rate sampling interval: 22069ms
  Thread calibration: mean lat.: 2410.602ms, rate sampling interval: 22003ms
  Thread calibration: mean lat.: 2306.211ms, rate sampling interval: 22036ms
  Thread calibration: mean lat.: 2398.872ms, rate sampling interval: 22036ms
  Thread calibration: mean lat.: 2341.514ms, rate sampling interval: 22020ms
  Thread calibration: mean lat.: 2577.390ms, rate sampling interval: 23216ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.17s    11.99s    0.88m    55.64%
    Req/Sec     2.90      0.70     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.57s 
 75.000%   42.96s 
 90.000%    0.86m 
 99.000%    0.88m 
 99.900%    0.88m 
 99.990%    0.88m 
 99.999%    0.88m 
100.000%    0.88m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12779.519     0.000000            2         1.00
   15802.367     0.100000          129         1.11
   20299.775     0.200000          259         1.25
   25477.119     0.300000          380         1.43
   30097.407     0.400000          509         1.67
   34570.239     0.500000          648         2.00
   34865.151     0.550000          687         2.22
   39518.207     0.600000          752         2.50
   39813.119     0.650000          814         2.86
   42762.239     0.700000          891         3.33
   42958.847     0.750000          939         4.00
   43188.223     0.775000          969         4.44
   48857.087     0.800000         1030         5.00
   48988.159     0.825000         1031         5.71
   49020.927     0.850000         1080         6.67
   49577.983     0.875000         1096         8.00
   49610.751     0.887500         1110         8.89
   51412.991     0.900000         1125        10.00
   52166.655     0.912500         1169        11.43
   52166.655     0.925000         1169        13.33
   52363.263     0.937500         1219        16.00
   52363.263     0.943750         1219        17.78
   52363.263     0.950000         1219        20.00
   52363.263     0.956250         1219        22.86
   52363.263     0.962500         1219        26.67
   52363.263     0.968750         1219        32.00
   52363.263     0.971875         1219        35.56
   52363.263     0.975000         1219        40.00
   52396.031     0.978125         1224        45.71
   52428.799     0.981250         1231        53.33
   52428.799     0.984375         1231        64.00
   52756.479     0.985938         1241        71.11
   52756.479     0.987500         1241        80.00
   52756.479     0.989062         1241        91.43
   52756.479     0.990625         1241       106.67
   52756.479     0.992188         1241       128.00
   52756.479     0.992969         1241       142.22
   52789.247     0.993750         1243       160.00
   52789.247     0.994531         1243       182.86
   52822.015     0.995313         1249       213.33
   52822.015     1.000000         1249          inf
#[Mean    =    34171.413, StdDeviation   =    11991.926]
#[Max     =    52789.248, Total count    =         1249]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2341 requests in 1.00m, 219.47KB read
  Socket errors: connect 0, read 69162, write 0, timeout 8310
  Non-2xx or 3xx responses: 2341
Requests/sec:     38.83
Transfer/sec:      3.64KB